app/views/items/show.html.erb

	<strong>Size:</strong>
	<%= @item.rfid.size %>
---
SELECT * FROM "rfids" INNER JOIN "items" ON "items"."id" = "rfids"."item_id"
SELECT COUNT(*) FROM "rfids" INNER JOIN "items" ON "items"."id" = "rfids"."item_id"