app/controllers/items_controller.rb

	def show
		@item = Item.find(params[:item_id])
---
SELECT  "items".* FROM "items" WHERE "items"."item_id" = $1 LIMIT 1  [["item_id", nil]]

	def index
		if params[:search]
			@items = Item.search(params[:search])
---
SELECT "items".* FROM "items" WHERE (name like '%Blue')